dwijaybane/LPC17xx-Drivers/Source Files/lpc17xx_uart_auto.c
	uchar pointer=0;          /* Pointer in buffer */
	uchar count=0;            /* character count */
    uint8_t temp;

	while(1)
	{
		kb = getche(UARTx);

		if (kb == In_ESC)                /* if ESCAPE pressed then exit */
		{
			return (kb);
		}

		else if (kb == In_CR)            /* CARRIAGE return ? */
		{
			s[pointer] = '\0';             /* put null char on last position */
			break;                         /* yes, exit from this loop */
		}

		else if(kb == In_DELETE || kb == In_BACKSPACE)
		{
			if(pointer==0)                 /* any characters entered */
			{
				continue;                    /* no, so get another character */
			}

			temp = Out_BACKSPACE;
		//	UART_SendByte(UARTx,Out_BACKSPACE);  /* go back one position */
			UART_Send(UARTx,&temp,1,BLOCKING);
			temp = Out_SPACE;
		//	UART_SendByte(UARTx,Out_SPACE);      /* erase char */
			UART_Send(UARTx,&temp,1,BLOCKING);
			temp = Out_BACKSPACE;
		//	UART_SendByte(UARTx,Out_BACKSPACE);  /* go back one more position */
			UART_Send(UARTx,&temp,1,BLOCKING);

			pointer--;                     /* decrement pointer */
			count--;                       /* decrement character count */

			continue;
		}

		else if(pointer < lim)
		{
			s[pointer] = kb;               /* save character and increment pointer */
			pointer++;
			count++;                       /* increment count */
		//	UART_SendByte(UARTx,kb);       /* echo character */
			UART_Send(UARTx,&kb,1,BLOCKING);

			continue;                      /* and get some more */
		}
		else
		{
			temp = In_BELL;
		//	UART_SendByte(UARTx,In_BELL);   /* ring the bell */
			UART_Send(UARTx,&temp,1,BLOCKING);
		}
	}
	return(count);
}

/*********************************************************************//**
 * @brief		Modified version of Standard Printf statement
 *
 * @par			Supports standard formats "%c %s %d %x"
 * 				"%d" and "%x" requires non-standard qualifiers,"%dfn, %xfn":-
 *		        f supplies a fill character
 *		        n supplies a field width
 *
 *				Supports custom formats  "%b  %u"
 *				"%b"	prints a 2 digit BCD value with leading zero
 *				"%u"	prints the 16 bit unsigned integer in hex format
 * @param[in]	UARTx	Selected UART peripheral used to send data,
 * 				should be:
 *  			- LPC_UART0: UART0 peripheral
 * 				- LPC_UART1: UART1 peripheral
 * 				- LPC_UART2: UART2 peripheral
 * 				- LPC_UART3: UART3 peripheral
 * @param[in] 	*format Character format
 * @param[in]   ...  <multiple argument>
 *
 * @return 		return with valid character or nothing
 **********************************************************************/
int16 printf(LPC_UART_TypeDef *UARTx, const char *format, ...)
{
	uchar hex[]= "0123456789ABCDEF";
	unsigned int width_dec[10] = { 1, 10, 100, 1000, 10000 };
	unsigned int width_hex[4] = { 0x1, 0x10, 0x100, 0x1000,};
	unsigned int temp;

	schar format_flag, fill_char;
	ulong32 u_val, div_val;
	uint16 base;

	schar *ptr;
	va_list ap;
	va_start(ap, format);

	for(;;)
	{
		while((format_flag = *format++) != '%')      /* until full format string read */
		{
			if(!format_flag)
			{                        /* until '%' or '\0' */
				return (0);
			}
			UART_Send(UARTx,&format_flag,1,BLOCKING);
		}

		switch(format_flag = *format++)
		{
			case 'c':
				format_flag = va_arg(ap, int);
				UART_Send(UARTx,&format_flag,1,BLOCKING);

				continue;

			default:
				UART_Send(UARTx,&format_flag,1,BLOCKING);

        		continue;

			case 'b':
				format_flag = va_arg(ap,int);
				UART_Send(UARTx,&(hex[(uint16)format_flag >> 4]),1,BLOCKING);
				UART_Send(UARTx,&(hex[(uint16)format_flag & 0x0F]),1,BLOCKING);

				continue;

			case 's':
				ptr = va_arg(ap, schar *);
				while(*ptr)
				{
					UART_Send(UARTx,&(*ptr++),1,BLOCKING);
				}

				continue;

			case 'u':
				base = 16;
				div_val = 0x100000;
				u_val = va_arg(ap, ulong32);
				do
				{
					UART_Send(UARTx,&(hex[u_val/div_val]),1,BLOCKING);
					u_val %= div_val;
					div_val /= base;
				}while(div_val);

				continue;

			case 'd':
				base = 10;
				fill_char = *format++;
				format_flag = ( *format++ ) - '1';
				div_val = width_dec[format_flag];
				u_val = va_arg(ap,int);

				if(((int)u_val) < 0)
				{
					u_val = - u_val;    /* applied to unsigned type, result still unsigned */
					temp = '-';
				    UART_Send(UARTx,&temp,1,BLOCKING);
				}

				goto  CONVERSION_LOOP;

			case 'x':
				base = 16;
				fill_char = *format++;
				format_flag = (*format++) - '1';
				div_val = width_hex[format_flag];
				u_val = va_arg(ap, int);

				CONVERSION_LOOP:
				while(div_val > 1 && div_val > u_val)
				{
					div_val /= base;
					UART_Send(UARTx,&fill_char,1,BLOCKING);
				}

				do
				{
					UART_Send(UARTx,&(hex[u_val/div_val]),1,BLOCKING);
					u_val %= div_val;
					div_val /= base;
				}while(div_val);
		}/* end of switch statement */
	}
	return(0);
}


/*********************************************************************//**
 * @brief		Force BREAK character on UART line, output pin UARTx TXD is
				forced to logic 0.
 * @param[in]	UARTx	UART peripheral selected, should be:
 *  			- LPC_UART0: UART0 peripheral
 * 				- LPC_UART1: UART1 peripheral
 * 				- LPC_UART2: UART2 peripheral
 * 				- LPC_UART3: UART3 peripheral
 * @return 		None
 **********************************************************************/
void UART_ForceBreak(LPC_UART_TypeDef* UARTx)
{
	CHECK_PARAM(PARAM_UARTx(UARTx));

	if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
	{
		((LPC_UART1_TypeDef *)UARTx)->LCR |= UART_LCR_BREAK_EN;
	}
	else
	{
		UARTx->LCR |= UART_LCR_BREAK_EN;
	}
}


/********************************************************************//**
 * @brief 		Enable or disable specified UART interrupt.
 * @param[in]	UARTx	UART peripheral selected, should be
 *  			- LPC_UART0: UART0 peripheral
 * 				- LPC_UART1: UART1 peripheral
 * 				- LPC_UART2: UART2 peripheral
 * 				- LPC_UART3: UART3 peripheral
 * @param[in]	UARTIntCfg	Specifies the interrupt flag,
 * 				should be one of the following:
				- UART_INTCFG_RBR 	:  RBR Interrupt enable
				- UART_INTCFG_THRE 	:  THR Interrupt enable
				- UART_INTCFG_RLS 	:  RX line status interrupt enable
				- UART1_INTCFG_MS	:  Modem status interrupt enable (UART1 only)
				- UART1_INTCFG_CTS	:  CTS1 signal transition interrupt enable (UART1 only)
				- UART_INTCFG_ABEO 	:  Enables the end of auto-baud interrupt
				- UART_INTCFG_ABTO 	:  Enables the auto-baud time-out interrupt
 * @param[in]	NewState New state of specified UART interrupt type,
 * 				should be:
 * 				- ENALBE: Enable this UART interrupt type.
* 				- DISALBE: Disable this UART interrupt type.
 * @return 		None
 *********************************************************************/
void UART_IntConfig(LPC_UART_TypeDef *UARTx, UART_INT_Type UARTIntCfg, FunctionalState NewState)
{
	uint32_t tmp;

	CHECK_PARAM(PARAM_UARTx(UARTx));
	CHECK_PARAM(PARAM_FUNCTIONALSTATE(NewState));

	switch(UARTIntCfg){
		case UART_INTCFG_RBR:
			tmp = UART_IER_RBRINT_EN;
			break;
		case UART_INTCFG_THRE:
			tmp = UART_IER_THREINT_EN;
			break;
		case UART_INTCFG_RLS:
			tmp = UART_IER_RLSINT_EN;
			break;
		case UART1_INTCFG_MS:
			tmp = UART1_IER_MSINT_EN;
			break;
		case UART1_INTCFG_CTS:
			tmp = UART1_IER_CTSINT_EN;
			break;
		case UART_INTCFG_ABEO:
			tmp = UART_IER_ABEOINT_EN;
			break;
		case UART_INTCFG_ABTO:
			tmp = UART_IER_ABTOINT_EN;
			break;
	}

	if ((LPC_UART1_TypeDef *) UARTx == LPC_UART1)
	{
		CHECK_PARAM((PARAM_UART_INTCFG(UARTIntCfg)) || (PARAM_UART1_INTCFG(UARTIntCfg)));
	}
	else
	{
		CHECK_PARAM(PARAM_UART_INTCFG(UARTIntCfg));
	}

	if (NewState == ENABLE)
	{
		if ((LPC_UART1_TypeDef *) UARTx == LPC_UART1)
		{
			((LPC_UART1_TypeDef *)UARTx)->/*DLIER.*/IER |= tmp;
		}
		else
		{
			UARTx->/*DLIER.*/IER |= tmp;
		}
	}
	else
	{
		if ((LPC_UART1_TypeDef *) UARTx == LPC_UART1)
		{
			((LPC_UART1_TypeDef *)UARTx)->/*DLIER.*/IER &= (~tmp) & UART1_IER_BITMASK;
		}
		else
		{
			UARTx->/*DLIER.*/IER &= (~tmp) & UART_IER_BITMASK;
		}
	}
}


